#!/usr/bin/env python3
# -*- coding: utf-8 -*-
import urllib.request
import re
import os
import sys

from bs4 import BeautifulSoup
from datetime import datetime
# from define import d_code


def jp_sqlite3_init():
    if (os.path.isfile('./korea_jp.db')):                                             
        return                                                                     
                                                                                   
    conn = sqlite3.connect('korea_jp.db')                                             
    c = conn.cursor()                                                              
# 종로구 ['   130,000', '2008', '2018', ' 무악동', '인왕산아이파크', '1', '21~31', '157.289', '60', '11110', '11']
    c.execute('''CREATE TABLE IF NOT EXISTS realestate
                 (code text PRIMARY KEY, destrict text, loc text)''')              
    conn.commit()                                                                  
                                                                                   
    f = open('../loc_code.txt')                                                    
    for d in f.readlines():                                                        
        data = d.split()                                                           
        c.execute('''INSERT OR REPLACE INTO localcode VALUES                       
                     ("%s", "%s", "%s")''' % (data[0], data[1], data[2]))          
                                                                                   
    conn.commit()                                                                  
                                                                                   
    f.close()                                                                      
    conn.close()                                                                   
    return                                                                         
                  


def realstate_trade():
    d_code = {
          '11110': '종로구',
          '11140': '중구',
          '11170': '용산구',
          '11200': '성동구',
          '11215': '광진구',
          }

     #     '11230': '동대문구',
     #     '11260': '중랑구',
     #     '11290': '성북구',
     #     '11305': '강북구',
     #     '11320': '도봉구',
     #     '11350': '노원구',
     #     '11380': '은평구',
     #     '11410': '서대문구',
     #     '11440': '마포구',
     #     '11470': '양천구',
     #     '11500': '강서구',
     #     '11530': '구로구',
     #     '11545': '금천구',
     #     '11560': '영등포구',
     #     '11590': '동작구',
     #     '11620': '관악구',
     #     '11650': '서초구',
     #     '11680': '강남구',
     #     '11710': '송파구',
     #     '11740': '강동구',
    #      '26110': '중구',
    #      '26140': '서구',
    #      '26170': '동구',
    #      '26200': '영도구',
    #      '26230': '부산진구',
    #      '26260': '동래구',
    #      '26290': '남구',
    #      '26320': '북구',
    #      '26350': '해운대구',
    #      '26380': '사하구',
    #      '26410': '금정구',
    #      '26440': '강서구',
    #      '26470': '연제구',
    #      '26500': '수영구',
    #      '26530': '사상구',
    #      '26710': '기장군',
    #      '27110': '중구',
    #      '27140': '동구',
    #      '27170': '서구',
    #      '27200': '남구',
    #      '27230': '북구',
    #      '27260': '수성구',
    #      '27290': '달서구',
    #      '27710': '달성군',
    #      '28110': '중구',
    #      '28140': '동구',
    #      '28170': '남구',
    #      '28185': '연수구',
    #      '28200': '남동구',
    #      '28237': '부평구',
    #      '28245': '계양구',
    #      '28260': '서구',
    #      '28710': '강화군',
    #      '28720': '옹진군',
    #      '29110': '동구',
    #      '29140': '서구',
    #      '29155': '남구',
    #      '29170': '북구',
    #      '29200': '광산구',
    #      '30110': '동구',
    #      '30140': '중구',
    #      '30170': '서구',
    #      '30200': '유성구',
    #      '30230': '대덕구',
    #      '31110': '중구',
    #      '31140': '남구',
    #      '31170': '동구',
    #      '31200': '북구',
    #      '31710': '울주군',
    #      '36110': '세종특별자치시',
    #      '41111': '수원장안구',
    #      '41113': '수원권선구',
    #      '41115': '수원팔달구',
    #      '41117': '수원영통구',
    #      '41131': '성남수정구',
    #      '41133': '성남중원구',
    #      '41135': '성남분당구',
    #      '41150': '의정부시',
    #      '41171': '안양만안구',
    #      '41173': '안양동안구',
    #      '41195': '부천원미구',
    #      '41197': '부천소사구',
    #      '41199': '부천오정구',
    #      '41210': '광명시',
    #      '41220': '평택시',
    #      '41250': '동두천시',
    #      '41271': '안산상록구',
    #      '41273': '안산단원구',
    #      '41281': '고양덕양구',
    #      '41285': '고양일산동구',
    #      '41287': '고양일산서구',
    #      '41290': '과천시',
    #      '41310': '구리시',
    #      '41360': '남양주시',
    #      '41370': '오산시',
    #      '41390': '시흥시',
    #      '41410': '군포시',
    #      '41430': '의왕시',
    #      '41450': '하남시',
    #      '41461': '용인처인구',
    #      '41463': '용인기흥구',
    #      '41465': '용인수지구',
    #      '41480': '파주시',
    #      '41500': '이천시',
    #      '41550': '안성시',
    #      '41570': '김포시',
    #      '41590': '화성시',
    #      '41610': '광주시',
    #      '41630': '양주시',
    #      '41650': '포천시',
    #      '41670': '여주시',
    #      '41800': '연천군',
    #      '41820': '가평군',
    #      '41830': '양평군',
    #      '42110': '춘천시',
    #      '42130': '원주시',
    #      '42150': '강릉시',
    #      '42170': '동해시',
    #      '42190': '태백시',
    #      '42210': '속초시',
    #      '42230': '삼척시',
    #      '42720': '홍천군',
    #      '42730': '횡성군',
    #      '42750': '영월군',
    #      '42760': '평창군',
    #      '42770': '정선군',
    #      '42780': '철원군',
    #      '42790': '화천군',
    #      '42800': '양구군',
    #      '42810': '인제군',
    #      '42820': '고성군',
    #      '42830': '양양군',
    #      '43111': '청주상당구',
    #      '43112': '청주서원구',
    #      '43113': '청주흥덕구',
    #      '43114': '청주청원구',
    #      '43130': '충주시',
    #      '43150': '제천시',
    #      '43720': '보은군',
    #      '43730': '옥천군',
    #      '43740': '영동군',
    #      '43745': '증평군',
    #      '43750': '진천군',
    #      '43760': '괴산군',
    #      '43770': '음성군',
    #      '43800': '단양군',
    #      '44131': '천안동남구',
    #      '44133': '천안서북구',
    #      '44150': '공주시',
    #      '44180': '보령시',
    #      '44200': '아산시',
    #      '44210': '서산시',
    #      '44230': '논산시',
    #      '44250': '계룡시',
    #      '44270': '당진시',
    #      '44710': '금산군',
    #      '44760': '부여군',
    #      '44770': '서천군',
    #      '44790': '청양군',
    #      '44800': '홍성군',
    #      '44810': '예산군',
    #      '44825': '태안군',
    #      '45111': '전주완산구',
    #      '45113': '전주덕진구',
    #      '45130': '군산시',
    #      '45140': '익산시',
    #      '45180': '정읍시',
    #      '45190': '남원시',
    #      '45210': '김제시',
    #      '45710': '완주군',
    #      '45720': '진안군',
    #      '45730': '무주군',
    #      '45740': '장수군',
    #      '45750': '임실군',
    #      '45770': '순창군',
    #      '45790': '고창군',
    #      '45800': '부안군',
    #      '46110': '목포시',
    #      '46130': '여수시',
    #      '46150': '순천시',
    #      '46170': '나주시',
    #      '46230': '광양시',
    #      '46710': '담양군',
    #      '46720': '곡성군',
    #      '46730': '구례군',
    #      '46770': '고흥군',
    #      '46780': '보성군',
    #      '46790': '화순군',
    #      '46800': '장흥군',
    #      '46810': '강진군',
    #      '46820': '해남군',
    #      '46830': '영암군',
    #      '46840': '무안군',
    #      '46860': '함평군',
    #      '46870': '영광군',
    #      '46880': '장성군',
    #      '46890': '완도군',
    #      '46900': '진도군',
    #      '46910': '신안군',
    #      '47111': '포항남구',
    #      '47113': '포항북구',
    #      '47130': '경주시',
    #      '47150': '김천시',
    #      '47170': '안동시',
    #      '47190': '구미시',
    #      '47210': '영주시',
    #      '47230': '영천시',
    #      '47250': '상주시',
    #      '47280': '문경시',
    #      '47290': '경산시',
    #      '47720': '군위군',
    #      '47730': '의성군',
    #      '47750': '청송군',
    #      '47760': '영양군',
    #      '47770': '영덕군',
    #      '47820': '청도군',
    #      '47830': '고령군',
    #      '47840': '성주군',
    #      '47850': '칠곡군',
    #      '47900': '예천군',
    #      '47920': '봉화군',
    #      '47930': '울진군',
    #      '47940': '울릉군',
    #      '48121': '창원의창구',
    #      '48123': '창원성산구',
    #      '48125': '창원마산합포구',
    #      '48127': '창원마산회원구',
    #      '48129': '창원진해구',
    #      '48170': '진주시',
    #      '48220': '통영시',
    #      '48240': '사천시',
    #      '48250': '김해시',
    #      '48270': '밀양시',
    #      '48310': '거제시',
    #      '48330': '양산시',
    #      '48720': '의령군',
    #      '48730': '함안군',
    #      '48740': '창녕군',
    #      '48820': '고성군',
    #      '48840': '남해군',
    #      '48850': '하동군',
    #      '48860': '산청군',
    #      '48870': '함양군',
    #      '48880': '거창군',
    #      '48890': '합천군',
    #      '50110': '제주시',
    #      '50130': '서귀포시',
    now = datetime.now()
    # time_str = '%4d%02d' % (now.year, now.month)
    time_str = '%4d%02d' % (now.year, now.month - 1)
    for i in range(0, 10):
        for j in range(1, 13):
            if i == 0:
                if j > now.month:
                    break
            time_str = '%4d%02d' % (now.year - i, j)
            apt_trade_url = os.environ.get('DATA_APT_TRADE_URL')
            data_svc_key = os.environ.get('DATA_APT_API_KEY')

            # apt_district_code

            for district_code, district in d_code.items():
                request_url = '%s?LAWD_CD=%s&DEAL_YMD=%s&serviceKey=%s' % (
                              apt_trade_url, district_code, time_str, data_svc_key)
                request_realstate_trade(request_url, district)
                return


def request_realstate_trade(request_url, district):
    req = urllib.request.Request(request_url)
    try:
        res = urllib.request.urlopen(req)
    except UnicodeEncodeError:
        print('[OpenAPI] UnicodeEncodeError')
        return

    data = res.read().decode('utf-8')
    soup = BeautifulSoup(data, 'html.parser')
    if (soup.resultcode.string != '00'):
        print('[OpenAPI] ',  soup.resultmsg.string)
        return
    items = soup.findAll('item')
    for item in items:
        try:
            infos = re.split('<.*?>', item.text)
        except TypeError:
            continue

        try:
            apt_size = float(infos[8])
        except ValueError:
            print(district, infos)
            continue
        price = int(infos[1].strip().replace(',', ''))
        print(district, infos[1:])

#        if 50.0 < apt_size < 90.0:  # 59 ~ 85
#            price = int(infos[1].strip().replace(',', ''))
#            if price > 99999:  # 10억 이상
#                ret_msg = '%s %s %s %s층(%sm²) %s만원\t\t[준공]%s년[거래]%s년%s월%s' % (
#                          district, infos[4], infos[5], infos[11], infos[8],
#                          price,
#                          infos[2],
#                          infos[3], infos[6], infos[7])
#            else:
#                ret_msg = '%s %s %s %s층(%sm²) %s만원\t\t[준공]%s년[거래]%s년%s월%s' % (
#                          district, infos[4], infos[5], infos[11], infos[8],
#                          price,
#                          infos[2],
#                          infos[3], infos[6], infos[7])
#            print(ret_msg)

'''
종로구 ['   130,000', '2008', '2018', ' 무악동', '인왕산아이파크', '1', '21~31', '157.289', '60', '11110', '11']
'''
if __name__ == '__main__':
    jp_sqlite3_init()
    realstate_trade()
